social-choice-theory/introduction.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: 社会的選択理論勉強会
#+date: <2022-09-02 金>
#+author: Hisanobu Nakamura
#+email: hisanobu@pop-os
#+language: ja
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3)

* 社会的選択理論への招待　坂井豊貴
社会的選択理論の入門書

** 本書の構成
- 第1章：ボルダとコンドル背による議論を紹介
  - ボルダの論文とコンドルセによる議論
- 第２章：コンドルセによる統計学的な議論について扱う。
  - 陪審定理について扱う。本書以外で、他に詳しい解説が見当たらないらしい。
- 第３章：多数決の代替案として、ボルダルールが望ましいという議論をする。
  - 他の代替案なしで安易に批判するものが少なくないが、ここでされる肯定的な議論を踏まえていないものが多い
  - この章の議論は主に1970年代になされたものだが、専門家の間でも十分に認識されているとは言い難く、再評価がなされてよいものだと筆者は言っている
- 第4章：政治と選択
  - ダンカン・ブラック(Duncan Black https://en.wikipedia.org/wiki/Duncan_Black)
    - 単峰性という条件が成り立つときはペア全勝者が存在することを発見。
    - 社会科学全般へのインパクトが大きかった。実証政治理論とメカニズムデザインという分野を生み出すきっかけとなった
- 第5章：ケネス・アローが考案した二項独立性という条件を中心に論じる。
  - コンドルセはペアごとに選択肢を比較することにこだわったが、アローはその姿勢を徹底追及して、飛行独立性という条件を定式化して議論を展開した
  - アローは、一般には二項独立性を尊重し切ることはできないという不可能性定理と、単峰性が成り立つときにはその不可能性が回避できるという可能性定理をともに示した。
    - 本書では、有権者数と選択肢がともに３であるケースについて詳細な証明を与える
- 第６章：社会状態の良し悪しを判定する基準である、社会構成基準について論じる。
  - 功利主義基準、ナッシュ基準、マキシミン基準、レキシミン基準などを比較検討
  - アローの不可能性定理再び。アマルティア・センの自由主義のパラドックス、ロールズ流の正義論に基づく解消の考察
- 第７章：社会的選択理論と人民主権社会を絡めて論じる。時事的なテーマ。

** 本書の特徴
社会的選択理論の教科書で、ボルダとコンドルセの古典から議論を立ち上げていく構成を取ったものはおそらく他にない。

現在、社会的選択理論というときには、
1) 投票における意思集約方法の設計
2) 社会状態の望ましさを評価する基準の構築

を主に含むことが多い。
本書は1) に軸足を置いているが、第６章で 2) についても詳しく扱う。日本で出版されている社会的選択理論の本は2)を重視する傾向が強く、1)を重視する書籍は珍しい。

* 第１章　問題の出発点
