social-choice-theory/introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2022-10-12 水 19:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>社会的選択理論勉強会</title>
<meta name="author" content="Hisanobu Nakamura" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">社会的選択理論勉強会</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org24f118f">社会的選択理論への招待　坂井豊貴</a>
<ul>
<li><a href="#org08cb77c">本書の構成</a></li>
<li><a href="#orgc782fd3">本書の特徴</a></li>
</ul>
</li>
<li><a href="#org6ec0ad2">第１章　問題の出発点</a>
<ul>
<li><a href="#orga6c424c">1.1.1 ボルダルールの提案</a></li>
<li><a href="#org7730454">1.1.2 ボルダ勝者と過半数有権者</a></li>
<li><a href="#org7e90b4c">1.1.3 ボルダルールの戦略的操作</a></li>
<li><a href="#org1074bee">1.2 コンドルセの考察を巡って</a></li>
<li><a href="#orga8f3874">1.2.1 コンドルセと一般意志</a>
<ul>
<li><a href="#orge6ed8fd">コンドルセの方法　選択肢が３つの場合の例</a></li>
<li><a href="#orga4487e1">ルソーの一般意志</a></li>
<li><a href="#org086a271">コンドルセの方法の瑕疵</a></li>
</ul>
</li>
<li><a href="#org4bcfd86">1.2.2 2択問題における多数決の優位性</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org24f118f" class="outline-2">
<h2 id="org24f118f">社会的選択理論への招待　坂井豊貴</h2>
<div class="outline-text-2" id="text-org24f118f">
<p>
社会的選択理論の入門書
</p>
</div>

<div id="outline-container-org08cb77c" class="outline-3">
<h3 id="org08cb77c">本書の構成</h3>
<div class="outline-text-3" id="text-org08cb77c">
<ul class="org-ul">
<li>第1章：ボルダとコンドル背による議論を紹介
<ul class="org-ul">
<li>ボルダの論文とコンドルセによる議論</li>
</ul></li>
<li>第２章：コンドルセによる統計学的な議論について扱う。
<ul class="org-ul">
<li>陪審定理について扱う。本書以外で、他に詳しい解説が見当たらないらしい。</li>
</ul></li>
<li>第３章：多数決の代替案として、ボルダルールが望ましいという議論をする。
<ul class="org-ul">
<li>他の代替案なしで安易に批判するものが少なくないが、ここでされる肯定的な議論を踏まえていないものが多い</li>
<li>この章の議論は主に1970年代になされたものだが、専門家の間でも十分に認識されているとは言い難く、再評価がなされてよいものだと筆者は言っている</li>
</ul></li>
<li>第4章：政治と選択
<ul class="org-ul">
<li>ダンカン・ブラック(Duncan Black <a href="https://en.wikipedia.org/wiki/Duncan_Black">https://en.wikipedia.org/wiki/Duncan_Black</a>)
<ul class="org-ul">
<li>単峰性という条件が成り立つときはペア全勝者が存在することを発見。</li>
<li>社会科学全般へのインパクトが大きかった。実証政治理論とメカニズムデザインという分野を生み出すきっかけとなった</li>
</ul></li>
</ul></li>
<li>第5章：ケネス・アローが考案した二項独立性という条件を中心に論じる。
<ul class="org-ul">
<li>コンドルセはペアごとに選択肢を比較することにこだわったが、アローはその姿勢を徹底追及して、飛行独立性という条件を定式化して議論を展開した</li>
<li>アローは、一般には二項独立性を尊重し切ることはできないという不可能性定理と、単峰性が成り立つときにはその不可能性が回避できるという可能性定理をともに示した。
<ul class="org-ul">
<li>本書では、有権者数と選択肢がともに３であるケースについて詳細な証明を与える</li>
</ul></li>
</ul></li>
<li>第６章：社会状態の良し悪しを判定する基準である、社会構成基準について論じる。
<ul class="org-ul">
<li>功利主義基準、ナッシュ基準、マキシミン基準、レキシミン基準などを比較検討</li>
<li>アローの不可能性定理再び。アマルティア・センの自由主義のパラドックス、ロールズ流の正義論に基づく解消の考察</li>
</ul></li>
<li>第７章：社会的選択理論と人民主権社会を絡めて論じる。時事的なテーマ。</li>
</ul>
</div>
</div>

<div id="outline-container-orgc782fd3" class="outline-3">
<h3 id="orgc782fd3">本書の特徴</h3>
<div class="outline-text-3" id="text-orgc782fd3">
<p>
社会的選択理論の教科書で、ボルダとコンドルセの古典から議論を立ち上げていく構成を取ったものはおそらく他にない。
</p>

<p>
現在、社会的選択理論というときには、
</p>
<ol class="org-ol">
<li>投票における意思集約方法の設計</li>
<li>社会状態の望ましさを評価する基準の構築</li>
</ol>

<p>
を主に含むことが多い。
本書は1) に軸足を置いているが、第６章で 2) についても詳しく扱う。日本で出版されている社会的選択理論の本は2)を重視する傾向が強く、1)を重視する書籍は珍しい。
</p>
</div>
</div>
</div>
