social-choice-theory/introduction.org
** 1.1.1 ボルダルールの提案
1770年にジャン＝シャルル・ド・ボルダ(Jean-Charles de Borda, 1733-1799)はパリ王立科学アカデミー(Académie des sciences)において、多数決という意思集約方法の本質的な欠陥に関する研究報告を行った。

冒頭パラグラフ：
#+begin_quote
「投票において再多数票を得た選択肢は、常に人々の意思を表していると一般に考えられているようで、私はそれに関する論争を聞いたことがない。つまりそうした選択肢は、他の選択肢よりも有権者からz好まれているはずだというわけである。
しかし私はこうした考えが、選択肢が２個しかないケースを除いては成立しないことを明らかにしていく。」
#+end_quote
有権者数:２１人 \\
選択肢: {x,y,z} (政策、候補者etc) \\
有権者が以下のような順序をつけているとする。\\

|     | 4 人 | 4 人 | 7 人 | 6 人 |
|-----+------+------+------+------|
| /   | <>   | <>   | <>   |<>    |
| 1位 | $x$  | $x$  | $y$  | $z$  |
| 2位 | $y$  | $z$  | $z$  | $y$  |
| 3位 | $z$  | $y$  | $x$  | $x$  |


これらの順序に基づき、一人の有権者が１枚の投票用紙を与えられ１つの選択肢を書く、 *単記式* の多数決を行えば

- ８票が $x$
- 7票が $y$
- 6票が $z$

に入り、 $x$ が勝つ。このように多数決でかつ選択肢のことを多数決勝者と呼ぶ。

ここで問題だが、$x$ は他の選択肢と比して有権者から高く評価されているといえるのだろうか？
実際、$x$ と $y$ だけをペアで比較してみると

- 8人が $x$ を $y$ より
- 13人が $y$ を $x$ より

高く評価しており、過半数のものは $y$ を $x$ より高く評価している。
また、 $x$ と $z$ だけをペアで比較してみても、同様に

- 8人が $x$ を $z$ より
- 13人が $z$ を $x$ より

高く評価しており、過半数のものは $z$ を $x$ より高く評価している。

つまり、 $x$ は $y$ にも $z$ にもペア毎の多数決で負ける選択肢である。

にも関わらずxが全体での多数決で勝てるのは、2つの選択肢yとzについて票が割れているからに他ならない。

このことをボルダは「2人のアスリートが競い疲れきってしまった後で、第3の最も弱い者に負けてしまうようなものだ」と表現した。

この観点から多数決に疑問を呈したボルダは次の *ボルダルール* と呼ばれるルールを考察した。

ボルダルール：各選択肢への順位をすべて書き、それに応じて加点し和を取る。選択肢の数が３つなら、1位に3点、2位に2点、3位に1点というように加点する。

今の例での得点和はそれぞれ

- $x$ の得点: $3\cdot 8 + 2 \cdot 0 + 1 \cdot 13 = 37$
- $y$ の得点: $3\cdot 7 + 2 \cdot 10 + 1 \cdot 4 = 45$
- $z$ の得点: $3\cdot 6 + 2 \cdot 11 + 1 \cdot 4 = 44$

となる。  

こうした得点和を *ボルダ得点* と呼び、 $p(x) = 37$ 、$p(y) = 45$ 、$p(z) = 44$ のように表す。
また、ボルダ得点が最大になる選択肢をボルダ勝者と呼ぶ。ここでのぼるだ勝者は $y$ である。

$x$ は、ペア全敗者と呼ぶことにする。

ボルダの論文では、「多数決がペア全敗者を選びうる」ことを指摘してから、ボルダルールを導入しているが、ボルダルールがペア全敗者を選ばないことの証明は書かれていない。
実際の証明が与えられたのは200年後。

*Theorem* ボルダ勝者はペア全敗者ではない。\\
*[Proof]*\\
今、次の状況を考える。
- 有権者：クロ、タマ、ポチ
- 選択肢: $x,y,z$
- 一人一人の有権者はそれぞれ、1位の選択肢に3点、2位に2点、3位に1点を加点する。
一般の場合も、同様の手法で証明できる（らしい）。

まず、
\begin{equation}
\label{eq:1}
p(x) + p(y) + p(z) = 18
\end{equation}

である。
今、$x$ をボルダ勝者とする、すなわち、$p(x) \ge p(y)$ かつ、 $p(x) \ge p(z)$ が成り立つとする。

このとき、$x$ はペア全敗者でありえないことを示す。

明らかに、
\begin{equation}
\label{eq:2}
p(x) \ge \frac{p(x)+p(y)+p(z)}{3} = 6
\end{equation}

が成り立つ。6点以上獲得するということは、$x$ は最悪でも
|          | クロ | タマ    | ポチ    |
|----------+------+---------+---------|
| /        | <>   | <>      | <>      |
| 1位(3点) | $x$  | $\star$ | $\star$ |
| 2位(2点) |      | $x$     | $\star$ |
| 3位(1点) |      |         | $x$     |

という順序付けや
|          | クロ    | タマ    | ポチ    |
|----------+---------+---------+---------|
| /        | <>      | <>      | <>      |
| 1位(3点) | $\star$ | $\star$ | $\star$ |
| 2位(2点) | $x$     | $x$     | $x$     |
| 3位(1点) |         |         |         |

という、$\star$ が3つしかないような順序付けになっているはずである。

もし、$\star$ が、４つ以上あると、 $p(x) < 6$ となるからである。

ここで、$x$ がペア全敗者であると仮定する。すなわち、ペア同士の多数決で $y$ 、 $z$ ともに $x$ に勝利することになる。

そのためには
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(3点) | $y$  | $z$  | $x$  |
| 2位(2点) | $z$  | $y$  |      |
| 3位(1点) | $x$  | $x$  |      |
や、
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(3点) | $y$  | $z$  | $z$  |
| 2位(2点) | $x$  | $x$  | $y$  |
| 3位(1点) |      |      | $x$  |

という順序付けが成り立たなければならない。
すなわち、 $x$ がペア全敗者であるためには、 テーブル上で $x$ より上に位置する選択肢が4個以上必要ということになる。
しかし、これは $p(x) \ge 6$ と矛盾する。よって、ボルダ勝者 $x$ は、ペア全敗者ではありえない。 $\square$
