social-choice-theory/introduction.html

<div id="outline-container-org6ec0ad2" class="outline-2">
<h2 id="org6ec0ad2">第１章　問題の出発点</h2>
<div class="outline-text-2" id="text-org6ec0ad2">
</div>
<div id="outline-container-orga6c424c" class="outline-3">
<h3 id="orga6c424c">1.1.1 ボルダルールの提案</h3>
<div class="outline-text-3" id="text-orga6c424c">
<p>
1770年にジャン＝シャルル・ド・ボルダ(Jean-Charles de Borda, 1733-1799)はパリ王立科学アカデミー(Académie des sciences)において、多数決という意思集約方法の本質的な欠陥に関する研究報告を行った。
</p>

<p>
冒頭パラグラフ：
</p>
<blockquote>
<p>
「投票において再多数票を得た選択肢は、常に人々の意思を表していると一般に考えられているようで、私はそれに関する論争を聞いたことがない。つまりそうした選択肢は、他の選択肢よりも有権者からz好まれているはずだというわけである。
しかし私はこうした考えが、選択肢が２個しかないケースを除いては成立しないことを明らかにしていく。」
</p>
</blockquote>
<p>
有権者数:２１人 <br />
選択肢: {x,y,z} (政策、候補者etc) <br />
有権者が以下のような順序をつけているとする。<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">4 人</th>
<th scope="col" class="org-left">4 人</th>
<th scope="col" class="org-left">7 人</th>
<th scope="col" class="org-left">6 人</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">2位</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">3位</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
</table>


<p>
これらの順序に基づき、一人の有権者が１枚の投票用紙を与えられ１つの選択肢を書く、 <b>単記式</b> の多数決を行えば
</p>

<ul class="org-ul">
<li>８票が \(x\)</li>
<li>7票が \(y\)</li>
<li>6票が \(z\)</li>
</ul>

<p>
に入り、 \(x\) が勝つ。このように多数決でかつ選択肢のことを多数決勝者と呼ぶ。
</p>

<p>
ここで問題だが、\(x\) は他の選択肢と比して有権者から高く評価されているといえるのだろうか？
実際、\(x\) と \(y\) だけをペアで比較してみると
</p>

<ul class="org-ul">
<li>8人が \(x\) を \(y\) より</li>
<li>13人が \(y\) を \(x\) より</li>
</ul>

<p>
高く評価しており、過半数のものは \(y\) を \(x\) より高く評価している。
また、 \(x\) と \(z\) だけをペアで比較してみても、同様に
</p>

<ul class="org-ul">
<li>8人が \(x\) を \(z\) より</li>
<li>13人が \(z\) を \(x\) より</li>
</ul>

<p>
高く評価しており、過半数のものは \(z\) を \(x\) より高く評価している。
</p>

<p>
つまり、 \(x\) は \(y\) にも \(z\) にもペア毎の多数決で負ける選択肢である。
</p>

<p>
にも関わらずxが全体での多数決で勝てるのは、2つの選択肢yとzについて票が割れているからに他ならない。
</p>

<p>
このことをボルダは「2人のアスリートが競い疲れきってしまった後で、第3の最も弱い者に負けてしまうようなものだ」と表現した。
</p>

<p>
この観点から多数決に疑問を呈したボルダは次の <b>ボルダルール</b> と呼ばれるルールを考察した。
</p>

<p>
ボルダルール：各選択肢への順位をすべて書き、それに応じて加点し和を取る。選択肢の数が３つなら、1位に3点、2位に2点、3位に1点というように加点する。
</p>

<p>
今の例での得点和はそれぞれ
</p>

<ul class="org-ul">
<li>\(x\) の得点: \(3\cdot 8 + 2 \cdot 0 + 1 \cdot 13 = 37\)</li>
<li>\(y\) の得点: \(3\cdot 7 + 2 \cdot 10 + 1 \cdot 4 = 45\)</li>
<li>\(z\) の得点: \(3\cdot 6 + 2 \cdot 11 + 1 \cdot 4 = 44\)</li>
</ul>

<p>
となる。  
</p>

<p>
こうした得点和を <b>ボルダ得点</b> と呼び、 \(p(x) = 37\) 、\(p(y) = 45\) 、\(p(z) = 44\) のように表す。
また、ボルダ得点が最大になる選択肢をボルダ勝者と呼ぶ。ここでのぼるだ勝者は \(y\) である。
</p>

<p>
\(x\) は、ペア全敗者と呼ぶことにする。
</p>

<p>
ボルダの論文では、「多数決がペア全敗者を選びうる」ことを指摘してから、ボルダルールを導入しているが、ボルダルールがペア全敗者を選ばないことの証明は書かれていない。
実際の証明が与えられたのは200年後。
</p>

<p>
<b>Theorem</b> ボルダ勝者はペア全敗者ではない。<br />
<b>[Proof]</b><br />
今、次の状況を考える。
</p>
<ul class="org-ul">
<li>有権者：クロ、タマ、ポチ</li>
<li>選択肢: \(x,y,z\)</li>
<li>一人一人の有権者はそれぞれ、1位の選択肢に3点、2位に2点、3位に1点を加点する。</li>
</ul>
<p>
一般の場合も、同様の手法で証明できる（らしい）。
</p>

<p>
まず、
</p>
\begin{equation}
\label{eq:1}
p(x) + p(y) + p(z) = 18
\end{equation}

<p>
である。
今、\(x\) をボルダ勝者とする、すなわち、\(p(x) \ge p(y)\) かつ、 \(p(x) \ge p(z)\) が成り立つとする。
</p>

<p>
このとき、\(x\) はペア全敗者でありえないことを示す。
</p>

<p>
明らかに、
</p>
\begin{equation}
\label{eq:2}
p(x) \ge \frac{p(x)+p(y)+p(z)}{3} = 6
\end{equation}

<p>
が成り立つ。6点以上獲得するということは、\(x\) は最悪でも
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(\star\)</td>
<td class="org-left">\(\star\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(\star\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
</table>

<p>
という順序付けや
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(\star\)</td>
<td class="org-left">\(\star\)</td>
<td class="org-left">\(\star\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
という、\(\star\) が3つしかないような順序付けになっているはずである。
</p>

<p>
もし、\(\star\) が、４つ以上あると、 \(p(x) < 6\) となるからである。
</p>

<p>
ここで、\(x\) がペア全敗者であると仮定する。すなわち、ペア同士の多数決で \(y\) 、 \(z\) ともに \(x\) に勝利することになる。
</p>

<p>
そのためには
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
や、
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
</table>

<p>
という順序付けが成り立たなければならない。
すなわち、 \(x\) がペア全敗者であるためには、 テーブル上で \(x\) より上に位置する選択肢が4個以上必要ということになる。
しかし、これは \(p(x) \ge 6\) と矛盾する。よって、ボルダ勝者 \(x\) は、ペア全敗者ではありえない。 \(\square\)
</p>
</div>
</div>
