social-choice-theory/introduction.org
** 1.1.2 ボルダ勝者と過半数有権者
今、5人の有権者がいる次の例を考えてみる：
|          | クロ | タマ | ポチ | ゴマ | ケロ |
|----------+------+------+------+------+------|
| /        | <>   | <>   | <>   | <>   | <>   |
| 1位(3点) | $y$  | $y$  | $y$  | $x$  | $x$  |
| 2位(2点) | $x$  | $x$  | $x$  | $z$  | $z$  |
| 3位(1点) | $z$  | $z$  | $z$  | $y$  | $y$  |

すると、$p(x)=12$ 、 $p(y)=11$ 、 $p(z)=7$ なので $x$ がボルダ勝者となる。

しかし、多数決勝者は $y$ であり、過半数の有権者が $y$ を $x$ より高く順序付けている。

つまり
- ボルダ勝者 $x$ と多数決勝者 $y$ が異なる。
- 過半数のものは $y$ を $x$ より好んでいる。
これは、ボルダルールと多数決の間に大きな対立が生じていると言える。

ボルダ「いったい多数決勝者が、ボルダ勝者でもあると *断定できる* のはどの程度の票を集めたときか？」

上の例のように、5人の有権者と3つの選択肢がある状況では、3票を得るだけでは、その選択肢がボルダ勝者だと断定することはできない。

4票ではどうだろうか？例えば、$y$ が下のように多数決で4票得たとしよう

|          | クロ | タマ | ポチ | ゴマ | ケロ |
|----------+------+------+------+------+------|
| /        | <>   | <>   | <>   | <>   | <>   |
| 1位(3点) | $y$  | $y$  | $y$  | $y$  | $x$  |
| 2位(2点) | ?    | ?    | ?    | ?    | ?    |
| 3位(1点) | ?    | ?    | ?    | ?    | ?    |

$y$ にとって、起こりうる最悪のケースは

|          | クロ | タマ | ポチ | ゴマ | ケロ |
|----------+------+------+------+------+------|
| /        | <>   | <>   | <>   | <>   | <>   |
| 1位(3点) | $y$  | $y$  | $y$  | $y$  | $x$  |
| 2位(2点) | $x$  | $x$  | $x$  | $x$  | ?    |
| 3位(1点) | ?    | ?    | ?    | ?    | $y$  |

である。しかし、このケースでさえ

\begin{equation}
\label{eq:3}
p(y) = 13 > 11 = p(x)
\end{equation}

なので、$y$ は多数決勝者でもあり、ボルダ勝者でもある。

選択肢を増やしてみたらどうだろうか？

有権者5人、選択肢6つで考えてみよう。以下の得票状況を考える

|          | クロ | タマ | ポチ | ゴマ | ケロ |
|----------+------+------+------+------+------|
| /        | <>   | <>   | <>   | <>   | <>   |
| 1位(6点) | $y$  | $y$  | $y$  | $x$  | $x$  |
| 2位(5点) | ?    | ?    | ?    | ?    | ?    |
| 3位(4点) | ?    | ?    | ?    | ?    | ?    |
| 4位(3点) | ?    | ?    | ?    | ?    | ?    |
| 5位(2点) | ?    | ?    | ?    | ?    | ?    |
| 6位(1点) | ?    | ?    | ?    | ?    | ?    |

このとき、$y$ がボルダ勝者であると断定する事は可能だろうか。

|          | クロ | タマ | ポチ | ゴマ | ケロ |
|----------+------+------+------+------+------|
| /        | <>   | <>   | <>   | <>   | <>   |
| 1位(6点) | $y$  | $y$  | $y$  | $x$  | $x$  |
| 2位(5点) | ?    | ?    | ?    | ?    | ?    |
| 3位(4点) | ?    | ?    | ?    | ?    | ?    |
| 4位(3点) | ?    | ?    | ?    | ?    | ?    |
| 5位(2点) | ?    | ?    | ?    | ?    | ?    |
| 6位(1点) | ?    | ?    | ?    | ?    | $y$  |
であり、
\begin{equation}
\label{eq:4}
p(y) = 25 < 26 = p(x)
\end{equation}
が成り立つ。

つまり、この状況では、$y$ がボルダ勝者であるとは断定できない。このケースで、多数決勝者がボルダ勝者であると断定できるのは、その選択肢が全票を集めた場合に限る。

ボルダはこの不一致が、選択肢の数が有権者の数を上回るときは、常に起こりうることを示した。

*Theorem 2*\\
有権者の数を $n$ 、選択肢の数を $m$ とし、 $n < m$ が成り立つとする。いま、多数決のもとで、 $n-1$ の有権者が $y$ に投票し、残る1人が $x$ に投票し、 $y$ が多数決勝者となるものとすると、 $y$ がボルダ勝者であるとは断定できない。
\\
*[Proof]* \\
いま $n-1$ 人が $y$ に投票し、残る1人が $x$ に投票するということは
|               | 有権者 $1$ | 有権者 $2$ | $\cdots$ | 有権者 $n-1$ | 有権者 $n$ |
|---------------+------------+------------+----------+--------------+------------|
| /             | <>         | <>         | <>       | <>           | <>         |
| 1位($m$ 点)   | $y$        | $y$        | $\cdots$ | $x$          | $x$        |
| 2位($m-1$ 点) | ?          | ?          | ?        | ?            | ?          |
| $\vdots$      |            |            |          |              |            |
| $m$ 位(1点)   | ?          | ?          | ?        | ?            | ?          |

のようなケースだということである。よって、以下の状況も起こりうる
|               | 有権者 $1$ | 有権者 $2$ | $\cdots$ | 有権者 $n-1$ | 有権者 $n$ |
|---------------+------------+------------+----------+--------------+------------|
| /             | <>         | <>         | <>       | <>           | <>         |
| 1位($m$ 点)   | $y$        | $y$        | $\cdots$ | $x$          | $x$        |
| 2位($m-1$ 点) | ?          | ?          | ?        | ?            | ?          |
| $\vdots$      |            |            |          |              |            |
| $m$ 位(1点)   | ?          | ?          | ?        | ?            | $y$        |

このとき、 $m > n$ より、
\begin{eqnarray}
\label{eq:5}
p(y) - p(x) & = & (n-1)m + 1 - (n-1)(m-1) - m \nonumber\\
            & = & n - m < 0
\end{eqnarray}

よって、 $y$ はボルダ勝者ではない。\\
$\square$

この定理から、「$n<m$ のときに多数決勝者がボルダ勝者と断定できるのは、全員一致の支持を得た場合のみに限る」ということがわかる。
