social-choice-theory/introduction.html
<div id="outline-container-org7730454" class="outline-3">
<h3 id="org7730454">1.1.2 ボルダ勝者と過半数有権者</h3>
<div class="outline-text-3" id="text-org7730454">
<p>
今、5人の有権者がいる次の例を考えてみる：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>

<p>
すると、\(p(x)=12\) 、 \(p(y)=11\) 、 \(p(z)=7\) なので \(x\) がボルダ勝者となる。
</p>

<p>
しかし、多数決勝者は \(y\) であり、過半数の有権者が \(y\) を \(x\) より高く順序付けている。
</p>

<p>
つまり
</p>
<ul class="org-ul">
<li>ボルダ勝者 \(x\) と多数決勝者 \(y\) が異なる。</li>
<li>過半数のものは \(y\) を \(x\) より好んでいる。</li>
</ul>
<p>
これは、ボルダルールと多数決の間に大きな対立が生じていると言える。
</p>

<p>
ボルダ「いったい多数決勝者が、ボルダ勝者でもあると <b>断定できる</b> のはどの程度の票を集めたときか？」
</p>

<p>
上の例のように、5人の有権者と3つの選択肢がある状況では、3票を得るだけでは、その選択肢がボルダ勝者だと断定することはできない。
</p>

<p>
4票ではどうだろうか？例えば、\(y\) が下のように多数決で4票得たとしよう
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>

<p>
\(y\) にとって、起こりうる最悪のケースは
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>

<p>
である。しかし、このケースでさえ
</p>

\begin{equation}
\label{eq:3}
p(y) = 13 > 11 = p(x)
\end{equation}

<p>
なので、\(y\) は多数決勝者でもあり、ボルダ勝者でもある。
</p>

<p>
選択肢を増やしてみたらどうだろうか？
</p>

<p>
有権者5人、選択肢6つで考えてみよう。以下の得票状況を考える
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(6点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(5点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">3位(4点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">4位(3点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">5位(2点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">6位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>

<p>
このとき、\(y\) がボルダ勝者であると断定する事は可能だろうか。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(6点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(5点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">3位(4点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">4位(3点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">5位(2点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">6位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>
<p>
であり、
</p>
\begin{equation}
\label{eq:4}
p(y) = 25 < 26 = p(x)
\end{equation}
<p>
が成り立つ。
</p>

<p>
つまり、この状況では、\(y\) がボルダ勝者であるとは断定できない。このケースで、多数決勝者がボルダ勝者であると断定できるのは、その選択肢が全票を集めた場合に限る。
</p>

<p>
ボルダはこの不一致が、選択肢の数が有権者の数を上回るときは、常に起こりうることを示した。
</p>

<p>
<b>Theorem 2</b><br />
有権者の数を \(n\) 、選択肢の数を \(m\) とし、 \(n < m\) が成り立つとする。いま、多数決のもとで、 \(n-1\) の有権者が \(y\) に投票し、残る1人が \(x\) に投票し、 \(y\) が多数決勝者となるものとすると、 \(y\) がボルダ勝者であるとは断定できない。
<br />
<b>[Proof]</b> <br />
いま \(n-1\) 人が \(y\) に投票し、残る1人が \(x\) に投票するということは
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">有権者 \(1\)</th>
<th scope="col" class="org-left">有権者 \(2\)</th>
<th scope="col" class="org-left">\(\cdots\)</th>
<th scope="col" class="org-left">有権者 \(n-1\)</th>
<th scope="col" class="org-left">有権者 \(n\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(\(m\) 点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(\cdots\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(\(m-1\) 点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">\(\vdots\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">\(m\) 位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>

<p>
のようなケースだということである。よって、以下の状況も起こりうる
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">有権者 \(1\)</th>
<th scope="col" class="org-left">有権者 \(2\)</th>
<th scope="col" class="org-left">\(\cdots\)</th>
<th scope="col" class="org-left">有権者 \(n-1\)</th>
<th scope="col" class="org-left">有権者 \(n\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(\(m\) 点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(\cdots\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(\(m-1\) 点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">\(\vdots\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">\(m\) 位(1点)</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>

<p>
このとき、 \(m > n\) より、
</p>
\begin{eqnarray}
\label{eq:5}
p(y) - p(x) & = & (n-1)m + 1 - (n-1)(m-1) - m \nonumber\\
            & = & n - m < 0
\end{eqnarray}

<p>
よって、 \(y\) はボルダ勝者ではない。<br />
\(\square\)
</p>

<p>
この定理から、「\(n<m\) のときに多数決勝者がボルダ勝者と断定できるのは、全員一致の支持を得た場合のみに限る」ということがわかる。
</p>
</div>
</div>
