social-choice-theory/introduction.org
** 1.1.3 ボルダルールの戦略的操作
戦略的投票に関する指摘について。
3人の有権者がいる、次の状況を考える。
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(4点) | $x$  | $y$  | $y$  |
| 2位(3点) | $y$  | $x$  | $x$  |
| 3位(2点) | $z$  | $z$  | $z$  |
| 4位(1点) | $w$  | $w$  | $w$  |

ここで、 $p(x) = 10, p(y) = 11, p(z) = 6, p(w) = 3$ であり、 $y$ がボルダ勝者となる。

$x$ を最も高く評価するクロにとってこの結果は好ましくない。しかし、もしクロが戦略的に虚偽の順序付けして
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(4点) | $x$  | $y$  | $y$  |
| 2位(3点) | $z$  | $x$  | $x$  |
| 3位(2点) | $w$  | $z$  | $z$  |
| 4位(1点) | $y$  | $w$  | $w$  |

となった場合には、 $p(x) = 10, p(y) = 9, p(z) = 7, p(w) = 4$ であり、ボルダ勝者は $x$ へと変わる。これはクロにとって望ましい結果だ。

もう一つの例として
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(3点) | $x$  | $y$  | $y$  |
| 2位(2点) | $z$  | $x$  | $x$  |
| 3位(1点) | $y$  | $z$  | $z$  |

を考える。この場合、 $p9x) = 7, p(y) = 7, p(z) = 4$ であり、ボルダ勝者は $x,y$ になる。

ここで、タマが戦略的に虚偽の投票をすることによって
|          | クロ | タマ | ポチ |
|----------+------+------+------|
| /        | <>   | <>   | <>   |
| 1位(3点) | $x$  | $y$  | $y$  |
| 2位(2点) | $z$  | $z$  | $x$  |
| 3位(1点) | $y$  | $x$  | $z$  |
となった場合、 $p(x) = 6, p(y) = 7, p(z) = 5$ であり、ボルダ勝者は $y$ となる。

つまり、$y$ を最も高く評価するタマは、 $y$ のライバルである $x$ を最下位に順序つけることによって、 $x$ ボルダ勝者の座から蹴落とすことができる。

この戦略的操作による影響は、現在考えられているどのような集約ルールについても完全に排除できないことが知られている。（ギバート＝サタスウェイト定理）
** 1.2 コンドルセの考察を巡って
