social-choice-theory/introduction.html
<div id="outline-container-org7e90b4c" class="outline-3">
<h3 id="org7e90b4c">1.1.3 ボルダルールの戦略的操作</h3>
<div class="outline-text-3" id="text-org7e90b4c">
<p>
戦略的投票に関する指摘について。
3人の有権者がいる、次の状況を考える。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(4点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">2位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">3位(2点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">4位(1点)</td>
<td class="org-left">\(w\)</td>
<td class="org-left">\(w\)</td>
<td class="org-left">\(w\)</td>
</tr>
</tbody>
</table>

<p>
ここで、 \(p(x) = 10, p(y) = 11, p(z) = 6, p(w) = 3\) であり、 \(y\) がボルダ勝者となる。
</p>

<p>
\(x\) を最も高く評価するクロにとってこの結果は好ましくない。しかし、もしクロが戦略的に虚偽の順序付けして
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(4点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">2位(3点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">3位(2点)</td>
<td class="org-left">\(w\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">4位(1点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(w\)</td>
<td class="org-left">\(w\)</td>
</tr>
</tbody>
</table>

<p>
となった場合には、 \(p(x) = 10, p(y) = 9, p(z) = 7, p(w) = 4\) であり、ボルダ勝者は \(x\) へと変わる。これはクロにとって望ましい結果だ。
</p>

<p>
もう一つの例として
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>
</tbody>
</table>

<p>
を考える。この場合、 \(p9x) = 7, p(y) = 7, p(z) = 4\) であり、ボルダ勝者は \(x,y\) になる。
</p>

<p>
ここで、タマが戦略的に虚偽の投票をすることによって
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(z\)</td>
</tr>
</tbody>
</table>
<p>
となった場合、 \(p(x) = 6, p(y) = 7, p(z) = 5\) であり、ボルダ勝者は \(y\) となる。
</p>

<p>
つまり、\(y\) を最も高く評価するタマは、 \(y\) のライバルである \(x\) を最下位に順序つけることによって、 \(x\) ボルダ勝者の座から蹴落とすことができる。
</p>

<p>
この戦略的操作による影響は、現在考えられているどのような集約ルールについても完全に排除できないことが知られている。（ギバート＝サタスウェイト定理）
</p>
</div>
</div>
<div id="outline-container-org1074bee" class="outline-3">
<h3 id="org1074bee">1.2 コンドルセの考察を巡って</h3>
</div>
