social-choice-theory/introduction.html
<div id="outline-container-orga8f3874" class="outline-3">
<h3 id="orga8f3874">1.2.1 コンドルセと一般意志</h3>
<div class="outline-text-3" id="text-orga8f3874">
<p>
コンドルセについて
</p>
<ul class="org-ul">
<li>M.J.A.N. Condorcet (1743-1794, コンドルセ)はパリ王立科学アカデミーの代表的な学者だった。数学への貢献によりアカデミーに入会。</li>
<li>数理分析を本格的に用いる社会科学の創始者の一人。</li>
<li>革命前には政治に関わり自由主義的な経済政策を推し進め、革命後は民主的な社会を強く思考する憲法草案を起草した。</li>
<li>公教育の重要性も論じた。</li>
<li>その他、活動は多岐にわたる。</li>
<li>コンドルセはルソー(Rouseau)の影響を強く受けた啓蒙思想(Lumieres)の理論化であり実践化であった。</li>
</ul>

<p>
1.1節で扱ったボルダ論文は、1770年にパリ王立科学アカデミーで発表した内容をまとめたものである。
この論文は1781年のアカデミー機関誌に解析(analyse)の分類で掲載され、1784年に出版された。
この掲載に、コンドルセが編集者として関わっており、彼によるボルダ論文の解説が収められている。
そこで彼は、多数決について、ボルダと同じような指摘をする。（ペア全敗者が多数決勝者になってしまうケースの指摘）
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">8 人</th>
<th scope="col" class="org-left">7 人</th>
<th scope="col" class="org-left">6 人</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">2位</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">3位</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
</table>

<p>
コンドルセは、選択肢が3つ以上の場合、多数決のようにペア全敗者を選ぶようなルールをはやめて、より望ましいものを探そうというモチベーションをボルダと深く共有している。
</p>

<p>
ボルダはそこで、ボルダルールを提案することで問題の解決を試みるが、コンドルセはそれとは異なる立場をとる。（ボルダの事は高く評価している）
</p>

<p>
コンドルセは集約ルールに対して、 <b>ペア全敗者を選ばないことのみならず、ペア全勝者が存在する場合には、それを選び取ること</b> を求めた。
</p>

<p>
<b>ペア全勝者</b> とは、他のどの選択肢に対しても、ペア毎の多数決で勝てる選択肢のこと。上記の例だと、\(z\) がペア全勝者。
</p>

<p>
ここでのボルダ得点は
</p>
\begin{eqnarray*}
\label{eq:6}
p(x) & = & 37\\
p(y) & = & 41\\
p(z) & = & 48
\end{eqnarray*}
<p>
なのでペア全勝者の \(z\) を選べている。しかし、この事は常には成り立たない、というのがコンドルセがボルダルールを否定する理由であった。
</p>

<p>
1.1節で出てきた下の例で見ると
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位(3点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位(2点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">3位(1点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>
\begin{eqnarray*}
\label{eq:7}
p(x) & = & 12\\
p(y) & = & 11\\
p(z) & = & 7
\end{eqnarray*}
<p>
なので、 \(x\) がボルダ勝者であるが、 ペア全勝者は \(y\) である。すなわち、ボルダルールはペア全勝者を選ぶことに失敗している。
</p>

<p>
コンドルセは、同様の失敗が、あらゆるスコアリングルールで起こりうることを示した。
</p>

<p>
スコアリングルールとは、各選挙人が \(m\) 個の選択肢に対して、好ましい順に \(a_{1} > a_{2} > \cdots > a_{m}\) という得点をつけて、その得点和で総合順位を決める集約ルールのことである。
例えば
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">クロ</th>
<th scope="col" class="org-left">タマ</th>
<th scope="col" class="org-left">ポチ</th>
<th scope="col" class="org-left">ゴマ</th>
<th scope="col" class="org-left">ケロ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位( \(a_{1}\) 点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>

<tr>
<td class="org-left">2位( \(a_{2}\) 点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">3位( \(a_{3}\) 点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
</tr>
</tbody>
</table>

<p>
における各選択肢の得点は
</p>
\begin{eqnarray*}
\label{eq:8}
p(x) & = & 2a_{1} + 3 a_{2}\\
p(y) & = & 3a_{1} + 2a_{3}\\
p(z) & = & 2s_{2} + 3a_{3}
\end{eqnarray*}
<p>
である。ボルダルールは \(a_{i} = i\) としたスコアリングルールである。
</p>

<p>
<b>Theorem 3</b> <br />
ペア全勝者が存在するにもかかわらず、どのスコアリングルールもそれを選び取れない状況がある。<br />
<b>Proof</b><br />
コンドルセはこの定理を、81人の有権者が存在する下の例を用いて証明した。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">30人</th>
<th scope="col" class="org-left">1人</th>
<th scope="col" class="org-left">29人</th>
<th scope="col" class="org-left">10人</th>
<th scope="col" class="org-left">10人</th>
<th scope="col" class="org-left">1人</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1位( \(a_{1}\) 点)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(z\)</td>
</tr>

<tr>
<td class="org-left">2位( \(a_{2}\) 点)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
</tr>

<tr>
<td class="org-left">3位( \(a_{3}\) 点)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(z\)</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(y\)</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
</table>

<p>
いま、ペア同士の多数決では41対40で \(x\) が \(y\) に勝ち、60対21で \(x\) が \(z\) に勝つので、\(x\) がペア全勝者である。
</p>

<p>
一方で、
</p>
\begin{eqnarray*}
\label{eq:9}
p(x) & = & 31a_{1} + 39 a_{2} + 11a_{3}\\
p(y) & = & 39a_{1} + 31a_{2} + 11a_{3}\\
p(z) & = & 11a_{1} + 11s_{2} + 59a_{3}
\end{eqnarray*}
<p>
なので、 \(a_{1} > a_{2} > a_{3}\) である限り、
</p>
\begin{eqnarray*}
\label{eq:10}
p(y) - p(x) & = & 8(a_{1} - a_{2})>  0 \\
p(x) - p(z) & = & 20a_{1} + 28a_{2} - 48a_{3} > 48(a_{2} - a_{3}) > 0
\end{eqnarray*}
<p>
よって、 \(p(y) > p(x) > p(z)\) が成り立つ。<br />
つまり、どのスコアリングルールでも \(y\) を1位とするので、\(x\) は選ばれない。 \(\square\)
</p>

<p>
この定理は、各選択肢に得点を割り振ってその総和により社会的選択を行うという、ボルダの発想の核心を否定するものだ。
この延長線上として、コンドルセは、それぞれの選択肢が「選択肢全体の中で」どの順位を与えられているかという観点を、意思集約から除外することを試みた。
</p>

<p>
具体的には、2つの選択肢についてそれぞれ多数決を行い、それらのショ結果を組み合わせて全体の判断を行うという研究プログラムの形をとることになる。
</p>
</div>
<div id="outline-container-orge6ed8fd" class="outline-4">
<h4 id="orge6ed8fd">コンドルセの方法　選択肢が３つの場合の例</h4>
<div class="outline-text-4" id="text-orge6ed8fd">
<p>
いま、有権者が13人として、3つの選択肢 \(x,y,z\) のうちそれぞれ2つに対し総当り戦でペア毎の多数決を行い、次の結果が得られたとしよう。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">\(x\)</th>
<th scope="col" class="org-right">\(y\)</th>
<th scope="col" class="org-right">\(z\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(x\)</td>
<td class="org-right">-</td>
<td class="org-right">8</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">\(y\)</td>
<td class="org-right">5</td>
<td class="org-right">-</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">\(z\)</td>
<td class="org-right">7</td>
<td class="org-right">2</td>
<td class="org-right">-</td>
</tr>
</tbody>
</table>

<p>
読み方:
</p>
<ul class="org-ul">
<li>\(x\) 対 \(y\) では、 8:5 で \(x\) が勝つ</li>
<li>\(z\) 対 \(x\) では、 7:6 で \(z\) が勝つ</li>
<li>\(y\) 対 \(z\) では、 11:2 で \(y\) が勝つ</li>
</ul>

<p>
ここでは、ペア毎の多数決で循環が生じている。これを <b>コンドルセサイクル</b> という（あるいは単に <b>サイクル</b> ）。
</p>

<p>
このサイクルをどうにか崩さなければならない。
</p>

<p>
そこで、コンドルセは、最も票差が小さな「7:6 で \(z\) が \(x\) に勝つ」を結果から消去することを提案した( <b>コンドルセの方法</b> )。
</p>

<p>
すると、
</p>
<ul class="org-ul">
<li>\(x\) 対 \(y\) では、 8:5 で \(x\) が \(y\) に勝つ</li>
<li>\(y\) 対 \(z\) では、 11:2 で \(y\) が \(z\) に勝つ</li>
</ul>
<p>
ので、全体の順位が \(xyz\) と決まり、勝者は \(x\) となる。
</p>

<p>
選択肢が3つの場合、この方法は、明瞭であり、得票差の小さな結果を無視するのは、直感的にも納得しやすい。
</p>

<p>
しかし、コンドルセにとっては、これは単なる直感以上のもので、「得票差の大きい結果は正しい可能性が高い」という考えに基づいている。
この「正しい」という表現は、コンドルセの問題意識を表している。
</p>
</div>
</div>
<div id="outline-container-orga4487e1" class="outline-4">
<h4 id="orga4487e1">ルソーの一般意志</h4>
<div class="outline-text-4" id="text-orga4487e1">
<p>
ルソーの『社会契約論(仏:Du Contrat Social; ou, Principes du droit, 英:The Social Contract) politique』<a href="https://en.wikipedia.org/wiki/The_Social_Contract#:~:text=The%20Social%20Contract%20helped%20inspire,have%20that%20all%2Dpowerful%20right.%20">https://en.wikipedia.org/wiki/The_Social_Contract#:~:text=The%20Social%20Contract%20helped%20inspire,have%20that%20all%2Dpowerful%20right.%20</a>では、一般意志(仏:volonté générale, 英:general will)という、ある種の共通利益を尊重することが重んじられる。
ルソーは一般意志と合致する選択肢を、人民の集会で多数決により探し当てることを考える。
そこでは各人は「私的利益に基づき何かを好む」ではなく、「私的立場を離れたうえでの、何が正しい可への判断」を表明することが求められる。
</p>

<p>
そしてルソーは「もし私の表明したことが多数決の結果と異なっているのならば、それは私が間違っていたことを意味しており、私が一般意志だと思っていたことがそうではなかったのだ」と論じている（第4篇、第2章）。
</p>

<p>
コンドルセはルソー的な意思集約を念頭に置いており、一般意志に合致する選択肢を見つける手段を見つけるのが彼の投票研究の問題意識であったと考えられる。
</p>

<p>
コンドルセ「これは渡井自身ではなく、全員にとっての問なのだ。つまり私は、私が単に良いと思うものを選ぶべきではない。各自固有の意見から抜け出た人々が理性と心理に適合すると考えるもの、を選ばねばならない」
</p>

<p>
一般意志に適うものがなにであるかは、最初から明らかなわけではない。
それゆえ、一般意志に合致する選択肢の探索手段としてルソーは投票を考えていたし、その考えを引き継いだコンドルセにとって、正しい可能性が高い選択肢を探すのは本質的なことであった。
</p>
</div>
</div>
