social-choice-theory/introduction.org
*** コンドルセの方法の瑕疵
コンドルセの方法は、選択肢が3つのときは簡単に実行できる。ペア全勝者が存在する場合には、それを選び取ればよい。
だが、選択肢が4つ以上存在するとき、この方法は必ずしもうまく機能しないことが、指摘された(Nanson, Black)。以下は Young による例。

|     | $x$ | $y$ | $z$ | $w$ |
|-----+-----+-----+-----+-----|
| /   |  <> |  <> |  <> |  <> |
| $x$ |   - |  12 |  15 |  17 |
| $y$ |  13 |   - |  16 |  11 |
| $z$ |  10 |   9 |   - |  18 |
| $w$ |   8 |  14 |   7 |   - |

多数決の結果は
- 13 : 12 で $y$ が $x$ に勝つ
- 15 : 10 で $x$ が $z$ に勝つ
- 17 : 8 で $x$ が $w$ に勝つ
- 16 : 9 で $y$ が $z$ に勝つ
- 14 : 11 で $w$ が $y$ に勝つ
- 18 : 7 で $z$ が $w$ に勝つ
となり、 サイクル $yxzwy$ が発生している。

ここから、最も得票差が小さい「13 : 12 で $y$ が $x$ に勝つ」を消去するとサイクル $yzwy$ が残る。

次に得票差が小さな結果である「14 : 11 で $w$ が $y$ に勝つ」を消去すると、
- 15 : 10 で $x$ が $z$ に勝つ
- 17 : 8 で $x$ が $w$ に勝つ
- 16 : 9 で $y$ が $z$ に勝つ
- 18 : 7 で $z$ が $w$ に勝つ
こととなり、これでサイクルはなくなった。しかし、残った結果からは、 $x$ と $y$ のどちらを上位にするかは確定できない。
これが、コンドルセの方法が上手くいかない例である。
** 1.2.2 2択問題における多数決の優位性
社会的選択に関するコンドルセの議論：
ある裁判の被告に対し、一人ひとりの有権者が独立に、「有罪」であるか「無罪」であるか判断して、いずれかに票を入れる多数決を考えて見よう。

有罪と無罪、どちらが正しいかは完全にはわからない。

有権者が、有罪と無罪を正しく判断できる確率が全有権者で同じ $0.5 < v \le 1$ であると仮定しよう。

これは、人間の判断が、完全にランダムな判断 $v = \frac{1}{2}$ よりは、制度が高いことを仮定している。

このかていのもと、3人の有権者が、それぞれ、独立に判断を行い、多数決を取った結果が正しい確率は

\begin{equation}
\label{eq:11}
v^{3} + 3v^{2}(1-v)
\end{equation}
である。
*Theorem 4* \\
$0.5 < v < 1$ ならば
\begin{equation}
\label{eq:12}
v^{3} + 3v^{2}(1-v) > v
\end{equation}
が成り立つ。すなわち、3人による多数決の結果が正しい確率は、一人が正しい確率を上回る。\\
*Proof*\\
$0.5 < v < 1$ であるから、
\begin{eqnarray}
\label{eq:13}
v^{3} + 3v^{2}(1-v) - v& = & v\{v^{2} + 3v(1-v) - 1\} \nonumber\\
                    & = & v(-2v^{2} + 3v - 1) \nonumber\\
                    & = & v(-2v + 1)(v - 1) \nonumber \\
                    & = & -2v(v - \frac{1}{2})(v - 1) > 0 \nonumber
\end{eqnarray}
$\square$
