social-choice-theory/introduction.html
<div id="outline-container-org086a271" class="outline-4">
<h4 id="org086a271">コンドルセの方法の瑕疵</h4>
<div class="outline-text-4" id="text-org086a271">
<p>
コンドルセの方法は、選択肢が3つのときは簡単に実行できる。ペア全勝者が存在する場合には、それを選び取ればよい。
だが、選択肢が4つ以上存在するとき、この方法は必ずしもうまく機能しないことが、指摘された(Nanson, Black)。以下は Young による例。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">\(x\)</th>
<th scope="col" class="org-right">\(y\)</th>
<th scope="col" class="org-right">\(z\)</th>
<th scope="col" class="org-right">\(w\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(x\)</td>
<td class="org-right">-</td>
<td class="org-right">12</td>
<td class="org-right">15</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-left">\(y\)</td>
<td class="org-right">13</td>
<td class="org-right">-</td>
<td class="org-right">16</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">\(z\)</td>
<td class="org-right">10</td>
<td class="org-right">9</td>
<td class="org-right">-</td>
<td class="org-right">18</td>
</tr>

<tr>
<td class="org-left">\(w\)</td>
<td class="org-right">8</td>
<td class="org-right">14</td>
<td class="org-right">7</td>
<td class="org-right">-</td>
</tr>
</tbody>
</table>

<p>
多数決の結果は
</p>
<ul class="org-ul">
<li>13 : 12 で \(y\) が \(x\) に勝つ</li>
<li>15 : 10 で \(x\) が \(z\) に勝つ</li>
<li>17 : 8 で \(x\) が \(w\) に勝つ</li>
<li>16 : 9 で \(y\) が \(z\) に勝つ</li>
<li>14 : 11 で \(w\) が \(y\) に勝つ</li>
<li>18 : 7 で \(z\) が \(w\) に勝つ</li>
</ul>
<p>
となり、 サイクル \(yxzwy\) が発生している。
</p>

<p>
ここから、最も得票差が小さい「13 : 12 で \(y\) が \(x\) に勝つ」を消去するとサイクル \(yzwy\) が残る。
</p>

<p>
次に得票差が小さな結果である「14 : 11 で \(w\) が \(y\) に勝つ」を消去すると、
</p>
<ul class="org-ul">
<li>15 : 10 で \(x\) が \(z\) に勝つ</li>
<li>17 : 8 で \(x\) が \(w\) に勝つ</li>
<li>16 : 9 で \(y\) が \(z\) に勝つ</li>
<li>18 : 7 で \(z\) が \(w\) に勝つ</li>
</ul>
<p>
こととなり、これでサイクルはなくなった。しかし、残った結果からは、 \(x\) と \(y\) のどちらを上位にするかは確定できない。
これが、コンドルセの方法が上手くいかない例である。
</p>
</div>
</div>
</div>
<div id="outline-container-org4bcfd86" class="outline-3">
<h3 id="org4bcfd86">1.2.2 2択問題における多数決の優位性</h3>
<div class="outline-text-3" id="text-org4bcfd86">
<p>
社会的選択に関するコンドルセの議論：
ある裁判の被告に対し、一人ひとりの有権者が独立に、「有罪」であるか「無罪」であるか判断して、いずれかに票を入れる多数決を考えて見よう。
</p>

<p>
有罪と無罪、どちらが正しいかは完全にはわからない。
</p>

<p>
有権者が、有罪と無罪を正しく判断できる確率が全有権者で同じ \(0.5 < v \le 1\) であると仮定しよう。
</p>

<p>
これは、人間の判断が、完全にランダムな判断 \(v = \frac{1}{2}\) よりは、制度が高いことを仮定している。
</p>

<p>
このかていのもと、3人の有権者が、それぞれ、独立に判断を行い、多数決を取った結果が正しい確率は
</p>

\begin{equation}
\label{eq:11}
v^{3} + 3v^{2}(1-v)
\end{equation}
<p>
である。
<b>Theorem 4</b> <br />
\(0.5 < v < 1\) ならば
</p>
\begin{equation}
\label{eq:12}
v^{3} + 3v^{2}(1-v) > v
\end{equation}
<p>
が成り立つ。すなわち、3人による多数決の結果が正しい確率は、一人が正しい確率を上回る。<br />
<b>Proof</b><br />
\(0.5 < v < 1\) であるから、
</p>
\begin{eqnarray}
\label{eq:13}
v^{3} + 3v^{2}(1-v) - v& = & v\{v^{2} + 3v(1-v) - 1\} \nonumber\\
                    & = & v(-2v^{2} + 3v - 1) \nonumber\\
                    & = & v(-2v + 1)(v - 1) \nonumber \\
                    & = & -2v(v - \frac{1}{2})(v - 1) > 0 \nonumber
\end{eqnarray}
<p>
\(\square\)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#20184;: 2022-09-02 金 00:00</p>
<p class="author">&#33879;&#32773;: Hisanobu Nakamura</p>
<p class="date">Created: 2022-10-12 水 19:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
